INTERESTS_MAP = {
    'trips': 'Путешествия',
    'sport': 'Спорт',
    'reading': 'Чтение',
    'music': 'Музыка',
    'cooking': 'Кулинария',
    'computer_games': 'Компьютерные игры',
    'photography_videography': 'Фотография и видеосъемка',
    'arts_crafts': 'Искусство и ремесла',
    'popular_science': 'Научно-популярные интересы',
    'fashion': 'Мода',
    'movies': 'Фильмы',
    'theater': 'Театр',
    'dancing': 'Танцы',
    'fitness': 'Фитнес',
    'yoga': 'Йога',
    'camping': 'Кемпинг',
    'hiking': 'Пешие прогулки',
    'biking': 'Велосипед',
    'gardening': 'Садоводство',
    'pets': 'Домашние животные',
    'environment': 'Экология',
    'volunteering': 'Волонтерство',
    'technology': 'Технологии',
    'entrepreneurship': 'Предпринимательство'
}


CITIES_RU = ['москва', 'санкт-петербург', 'питер', 'новгород', 'казань', 'нижний новгород', 'ростов',
             'екатеринбург', 'самара', 'омск', 'калининград', 'челябинск', 'ростов-на-дону', 'уфа', 'красноярск',
             'воронеж', 'пермь', 'волгоград', 'краснодар', 'саратов', 'тольятти', 'ижевск', 'барнаул', 'тюмень',
             'иркутск', 'хабаровск', 'владивосток', 'новосибирск', 'ярославль', 'улан-удэ', 'махачкала', 'оренбург',
             'томск', 'киров', 'набережные челны', 'чита', 'пенза', 'архангельск', 'астрахань', 'липецк', 'тула',
             'брянск', 'сочи', 'курск', 'ставрополь', 'кемерово', 'волжский', 'магнитогорск', 'севастополь', 'мурманск',
             'белгород', 'владимир', 'находка', 'майкоп', 'орёл', 'нижнекамск', 'ульяновск', 'балаково', 'калуга',
             'чебоксары', 'рязань', 'абакан', 'нальчик', 'магадан', 'грозный', 'новороссийск', 'якутск', 'петрозаводск',
             'благовещенск', 'назрань', 'арзамас', 'тамбов', 'элиста', 'магас', 'псков', 'можга', 'новокузнецк',
             'мозырь', 'северодвинск', 'салехард', 'сургут', 'сыктывкар', 'кострома', 'копейск', 'курган',
             'новочеркасск', 'прокопьевск', 'салават', 'сеймчан', 'стерлитамак', 'таганрог', 'тында', 'уссурийск',
             'фрязино', 'шахты', 'щекино']


LIFE_GOALS = ["Семья и дети", "Карьера и деньги", "Развлечения и отдых", "Наука и исследования",
              "Совершенствование мира", "Саморазвитие", "Красота и искусство", "Пропустить"]
MAIN_IN_PEOPLE = ["Ум и креативность", "Доброта и честность", "Красота и здоровье",
                  "Власть и богатство", "Смелость и упорство", "Юмор и жизнелюбие", "Пропустить"]
ATTITUDE_OPTIONS = [
    "Резко негативное", "Негативное", "Компромиссное", "Нейтральное", "Положительное", "Пропустить"
]
